[
    {
      "title": "Classic Clue",
      "buyLink": "https://www.amazon.com/Winning-Moves-Games-Clue-Classic/dp/B00349MPQQ?dib=eyJ2IjoiMSJ9.Rx1M9vo3Awo2npvY33egaXobwCkhE6CI2B0QrLkZvFCzpvRYDLrJhDbqvvQv8utvh7QLTKQA7JxmnOv196GYmAruwFGxK-EUDlI5eywGiwacb-hZ8pAEDvzS8rha3POGk3C5aSGoNm4oppUlmFHgRwI5dHNZa5eemxwF2Ckf0zLPVxiNAWySUgi7m1L4atgdcTMbnAMMjyYGsNJXg64tz2Z17zSIV7XdduNoRTP7wWM.EarCPkg76IVfErUveBg_IEMNcEhs-K-lpFzb7hAsuXE&dib_tag=se&keywords=clue+1949&qid=1730846559&sr=8-1",
      "imageUrl": "https://m.media-amazon.com/images/I/91wnpIcMUEL._AC_SL1500_.jpg",
      "altText": "Cover of Classic Clue Box",
      "text": "The suspects you know, in the mansion you remember, with the implements you love are all included! For generations, Mr. Boddy has met his end at the hand of one of six legendary suspects in the classic detective game, CLUE. Professor Plum, Mrs. White, Mr. Green, Mrs. Peacock, Miss Scarlett, and Colonel Mustard are all here in Boddy Mansion. One of them has done away with Mr. Boddy, but in which of the nine rooms? (Perhaps the Library, or Lounge, or Conservatory)?",
      "year": "1949"
    },
    {
      "title": "Clue: Alfred Hitchcock",
      "buyLink": "https://www.ebay.com/itm/255188613903",
      "imageUrl": "../images/clue/alfred.jpg",
      "altText": "Cover of Alfred Hitchcock Clue Box",
      "text": "This new spine-tingling version of America's \"whodunit\" boardgame Clue honor's Alfred Hitchcock on his 100th birthday and the 50th anniversary of Clue's debut. Experience the bone chilling shower scene from Psycho and much more.",
      "year": "1999"
    },
    {
      "title": "Clue: The Big Bang Theory",
      "buyLink": "https://www.ebay.com/itm/384742947579",
      "imageUrl": "../images/clue/bigbang.jpg",
      "altText": "Cover of The Big Bang Theory Clue Box",
      "text": "Sheldon's been betrayed, and he's demanding justice! Someone has meddled with one of his sacred belongings and he isn't taking it lightly. He's sequestered 6 of his so-called \"friends\" and created a white board to analyze who did it, what heinous deed was done, and where the act of vengeance took place. Did Penny dog-ear the comic-book in the laundry room? Or did Howard dismantle the Shelbot in the stairwell? Only YOU can help Sheldon determine who the culprit is or bear witness to a life made miserable by a scorned man!",
      "year": "2013"
    },
    {
      "title": "Clue: Bob's Burgers",
      "buyLink": "https://www.amazon.com/USAopoly-Burgers-Officially-Licensed-Mystery/dp/B07BP4K7HP",
      "imageUrl": "https://m.media-amazon.com/images/I/91T81lTeiNL._AC_SL1500_.jpg",
      "altText": "Cover of Bob's Burgers Clue Box",
      "text": "Join the Belcher family in a 'whodunit' that's more mindboggling than finding mayonnaise in the microwave. Clue: Bob's Burgers lets you piece together the answers to WHO killed 'Ned Boddy', WHAT weapon was left behind, and WHICH room of the apartment was the scene of the crime!",
      "year": "2018"
    },
    {
      "title": "Clue: Brooklyn Nine-Nine",
      "buyLink": "https://www.amazon.com/USAOPOLY-Nine-Nine-Collectible-Featuring-Officially-Licensed/dp/B09CH9JPWQ",
      "imageUrl": "https://m.media-amazon.com/images/I/81O+xaTF3LL._AC_SL1500_.jpg",
      "altText": "Cover of Brooklyn Nine-Nine Clue Box",
      "text": "It's Halloween, and the officers of Brooklyn's 99th Precinct have planned the heist of all heists to determine who really deserves the title of The Ultimate Human/Genius! Taking on the roles of Jake Peralta, Rosa Diaz, Terry Jeffords, Amy Santiago, Charles Boyle, and Raymond Holt, work to solve the mystery of WHO last had the trophy, WHICH trophy is secretly the ultimate trophy, and WHERE they've stashed it!",
      "year": "2021"
    },
    {
      "title": "Clue: Doctor Who",
      "buyLink": "https://www.amazon.com.au/Doctor-Who-Clue-Board-Game/dp/B00TTX58B0",
      "imageUrl": "https://m.media-amazon.com/images/I/71h6JUa32VL._AC_SL1000_.jpg",
      "altText": "Cover of Doctor Who Clue Box",
      "text": "Doctor Who CLUE places your favourite characters on a search through the Universe to rescue the Doctor. Playing as his closest friends and allies, players must reveal who amongst them the Daleks conditioned and mind-controlled to mislead the Doctor, what powerful weapon was used in the crime, and where The Doctor has been taken in the kidnapping, thereby saving him from the Daleks!",
      "year": "2015"
    },
    {
      "title": "Clue: Finding Nemo",
      "buyLink": "https://www.amazon.com/USAOPOLY-CLUE-Finding-Collectible-Animated/dp/B09STHQMYY",
      "imageUrl": "https://m.media-amazon.com/images/I/712Gk5f9r+L._AC_SL1500_.jpg",
      "altText": "Cover of Finding Nemo Clue Box",
      "text": "\"Just keep swimming\" and solve the mystery to win this undersea version of the classic mystery game, based on Disney and Pixar's beloved franchise! In CLUE: Finding Nemo, forgetful Dory has gotten lost while playing hide and seek, and it's up to her friends to find her! Take on the roles of the movies' finned and feathered characters to figure out WHAT perils Dory may face, WHO will have to help in the plan to find her, and WHERE she'll ultimately be found!",
      "year": "2022"
    },
    {
      "title": "Clue: Friends",
      "buyLink": "https://www.amazon.com/USAOPOLY-CLUE-Collectible-Officially-Licensed-Merchandise/dp/B0B8DYBGP1",
      "imageUrl": "https://m.media-amazon.com/images/I/71lxVwR5vfL._AC_SL1500_.jpg",
      "altText": "Cover of Friends Clue Box",
      "text": "Just remember, \"They don't know that we know they know we know.\" There's even more to love about your favorite New Yorkers in this hilarious version of the classic mystery game! Based on the unforgettable 90s sitcom, CLUE: Friends is \"The One with the Secrets\" as one of the crew is keeping a personal revelation under wraps that is bound to be revealed! Take on the roles of Rachel, Monica, Phoebe, Chandler, Joey, and Ross to get to the bottom of WHICH secret is being kept, WHO reveals it, and WHERE in New York City it's found out!",
      "year": "2022"
    },
    {
      "title": "Clue: Game of Thrones",
      "buyLink": "https://www.amazon.com/USAopoly-Thrones-Official-Merchandise-Popular/dp/B01F00U4VY",
      "imageUrl": "https://m.media-amazon.com/images/I/71mnLkF4XBL._AC_SL1000_.jpg",
      "altText": "Cover of Game of Thrones Clue Box",
      "text": "High treachery and betrayal are behind the two mysteries to solve in Game of Thrones Clue. Featuring a double-sided game board, players choose to solve the murder mystery in the Red Keep or in Meereen. Who was responsible for plotting the murder? What weapon was used and where did the crime take place?",
      "year": "2016"
    },
    {
      "title": "Clue: Golden Girls",
      "buyLink": "https://www.amazon.com/Lastpiece-Cheesecake-Officially-Licensed-Merchandise/dp/B06Y1RYTNJ?source=ps-sl-shoppingads-lpcontext&ref_=fplfs&psc=1&smid=ATVPDKIKX0DER",
      "imageUrl": "https://m.media-amazon.com/images/I/91BzWzX6DrL._AC_SL1500_.jpg",
      "altText": "Cover of Golden Girls Clue Box",
      "text": "The Golden Girls Clue features a custom illustrated game board, where players attempt to solve the crime of WHO ate the cheesecake, WHAT they left at the scene of the crime, and WHICH room they did it in.",
      "year": "2017"
    },
    {
      "title": "Clue: Harry Potter",
      "buyLink": "https://www.amazon.com/Hasbro-Gaming-Clue-Wizarding-Exclusive/dp/B089GZQD9M?source=ps-sl-shoppingads-lpcontext&ref_=fplfs&smid=ATVPDKIKX0DER&th=1",
      "imageUrl": "https://m.media-amazon.com/images/I/81jLZH0+4KL._AC_SL1500_.jpg",
      "altText": "Cover of Harry Potter Clue Box",
      "text": "In this Harry Potter Edition of the Clue game, a student has vanished from the Hogwarts School of Witchcraft and Wizardry. Who can solve the mysterious disappearance? Kids play as Harry, Ron, Hermione, Ginny, Luna, or Neville, and try to discover who did it, what spell or item was used, and where the attack happened.",
      "year": "2008"
    },
    {
      "title": "Clue: The Muppets",
      "buyLink": "https://www.amazon.com/USAOPOLY-CLUE-MUPPETS/dp/B0CSPSRGVL",
      "imageUrl": "https://m.media-amazon.com/images/I/81tYNU8Hw7L._AC_SL1500_.jpg",
      "altText": "Cover of The Muppets Clue Box",
      "text": "Join Muppets Kermit (Mayor Green), Fozzie (Colonel Mustard), and more as they put on a Murder Mystery Show in Clue The Muppets! Explore the Muppet Theater and track down Clues leading to classic Muppet props to figure out WHO did it, WHERE it happened, and WHAT weapon was used!",
      "year": "2024"
    },
    {
      "title": "Clue: The Office",
      "buyLink": "https://www.amazon.com/Clue-Office-Exclusive-Board-Game/dp/B0817G5X6Z",
      "imageUrl": "https://m.media-amazon.com/images/I/71f+wTXUCML._AC_SL1500_.jpg",
      "altText": "Cover of The Office Clue Box",
      "text": "Get ready to discover the secrets of Dunder Mifflin, Scranton. Regional Manager, Michael Scott, calls a \"mandatory\" team-building event, where six employees must work independently to figure out... WHO killed Toby Flenderson? WHAT office weapon was used? WHERE at Dunder Mifflin did it occur? The employee that wins gets a week's paid vacation! If the crime is not solved by the end of the day, Michael will give up on his team and go home. In Clue: The Office edition, can you outwit your co-workers and overcome your boss' meddling to win the game?",
      "year": "2009"
    },
    {
      "title": "Clue: Scooby-Doo!",
      "buyLink": "https://www.amazon.com/CLUE-Scooby-Doo-Merchandise-Featuring-Characters/dp/B07M5BMVS3",
      "imageUrl": "https://m.media-amazon.com/images/I/91HBv0FZiAL._AC_SL1500_.jpg",
      "altText": "Cover of Scooby Doo Clue Box",
      "text": "Monstrous abductions are happening at Mrs. Whites Haunted Mansion! Its up to Scooby-Doo and the gang to discover WHO was abducted, WHERE the abduction took place and WHAT Item the Monster left behind!",
      "year": "2019"
    },
    {
      "title": "Clue: Seinfeld",
      "buyLink": "https://www.amazon.com/USAopoly-CL010-262-Clue-Seinfeld/dp/B001XCXEGQ",
      "imageUrl": "https://m.media-amazon.com/images/I/61+ypvg37VL._AC_SL1000_.jpg",
      "altText": "Cover of Seinfeld Clue Box",
      "text": "\"When you control the mail, you control information.\" To prevent Newman from divulging the dirt on everyone he knows, someone took him out before his newsletter could get in the hands of the neighborhood! Take on the roles of show characters Elaine, Jerry, George, Kramer, Peterman, and Puddy to narrow down WHO knocked out Newman, WHAT weapon they used, and WHERE in the city the tell-all papers were stashed before the postman is able to file a report!",
      "year": "2009"
    },
    {
      "title": "Clue: Simpsons",
      "buyLink": "https://www.etsy.com/listing/667277343/the-simpsons-clue-board-game-homer-bart",
      "imageUrl": "https://i.etsystatic.com/6017061/r/il/5ded0f/1718511792/il_1588xN.1718511792_g0er.jpg",
      "altText": "Cover of Simpsons Clue Box",
      "text": "Chief Wiggum finds wealthy industrialist Charles Montgomery Burns dead, and it looks like foul play. Wiggum rounds up six likely suspects: Homer, Marge, Lisa, and Bart Simpson, Krusty the clown and Waylon Smithers. The fingered suspects, dressed-up as their favorite Clue character, try to figure out who bumped off Mr. Burns. To win, you must determine the answers to these three questions: Who did it? Where? and with what Weapon?",
      "year": "2000"
    },
    {
      "title": "Clue: Star Wars",
      "buyLink": "https://www.amazon.com/Hasbro-Clue-Game-Star-Wars/dp/B01HH0NSW2",
      "imageUrl": "https://m.media-amazon.com/images/I/61iMv-QdGQL._AC_SL1200_.jpg",
      "altText": "Cover of Star Wars Clue Box",
      "text": "The mystery game players love to solve again and again now has a Star Wars twist! In this Star Wars edition of the popular \"who done it\" Clue game, players move about the gameboard as one of their favorite Star Wars characters on an important a mission to foil Darth Vader's plans, and to save the Galaxy from destruction.",
      "year": "2016"
    },
    {
      "title": "Clue: Supernatural",
      "buyLink": "https://www.hottopic.com/product/supernatural-collectors-edition-clue-board-game/10991304.html",
      "imageUrl": "../images/clue/spn.jpg",
      "altText": "Cover of Supernatural Clue Box",
      "text": "One of your favorite Supernatural characters has been possessed & is committing terrible deeds! Now is the time for you to become the hunter and attempt to discover - WHO is possessed, WHAT mystical object was used to open the demon portal, and WHERE the portal was opened! Was it Sam with the Revolver in the Rocky Mountains? Or Dean on the West Coast with the Winchester Journal? Solve the mystery and victory will be yours.",
      "year": "2014"
    },
    {
      "title": "Clue: Amphibians",
      "buyLink": "https://www.britannica.com/animal/amphibian",
      "imageUrl": "../images/clue/frog.webp",
      "altText": "Strawberry Poison Dart Frog",
      "text": "A homemade version using different amphibians, their diet, and their habitats as the suspects, weapons, and rooms. Who was poisoned with what food and where?",
      "year": "2017"
    },
    {
      "title": "Clue: BTS",
      "buyLink": "https://shop.weverse.io/en/shop/GL_USD/artists/2/categories/175",
      "imageUrl": "../images/clue/bts.jpg",
      "altText": "Homemade BTS Clue Board out of posterboard with paper weapons, die, and player tokens",
      "text": "Another homemade version using the KPOP group BTS. Who stole ARMYs' hearts with what and where?",
      "year": "2020"
    }
]  